# HostObjectUtils Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
HostObjectUtils Class
Members See Also
---
These are generic host object utilities.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public static class HostObjectUtils
```

Visual Basic
---
```text
Public NotInheritable Class HostObjectUtils
```

Visual C++
---
```text
public ref class HostObjectUtils abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..HostObjectUtils
# See Also
HostObjectUtils Members
Autodesk.Revit.DB Namespace